do

local function run(msg,matches)

local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'اوامر' then
local alnaze = [[ 
 🔹➖🔹اوامر الرفع🔹➖🔹 
🔼 رفع اداري = رفع مدير
🔽 تنزيل ادري = تنزيل مدير
🔼 رفع ادمن = رفع ادمن
🔽 تنزيل ادمن = حذف ادمن
🔰الادمنيه =  ادمنية المجموعة
🔰 الاداريين = اداريين المجموعه
🔹➖🔹الحظر والطرد🔹➖🔹
🚫 بلوك > طرد العضو
⚠️ حظر > حظر العضو
🔘 الغاء الحظر > فتح الحظر
🔘 قائمه المحظورين> لعرض قائمه المحظورين في المجموعه
🔘 قائمه العام > قائمه المحظورين عام 
🔘 الغاء العام  > فتح الحظر العام عن العضو 
🔘 مغادره : للخروج من المجموعة
🔘 كتم > كتم العضو
🔘 كتم > فتح الكتم عن العضو
🔘! منع +كلمه > لحظر الكلمه
🔘! سماح +الكلمه > لفتح حظر الكلمه 
🔘! الكلمات الممنوعه >  لعرض الكلمات المحظورة
🔹➖🔹الايدي والاعدادات🔹➖🔹
⚙ ايدي  > لاظهار الايدي الخاص بك او ايدي العضو بالرد
⚙ معلوماتي > اضهار معلوماتك 
⚙ معلومات المجموعه > اضهار معلومات بالمجموعة
⚙ الاعدادات > اضهار اعدادات المجموعة
⚙ اعدادات الوسائط > اضهار اعدادات الوسائط
🔹➖🔹اعدادات المجموعه🔹➖🔹
🌐القوانين > لاضهار القوانين
🌐 ضع قوانين > لاظافة القوانين
🌐 ضع وصف > لاظافه وصف حول
🔶 ضع صوره > وضع صوره المجموعه
🔷 ضع اسم > لوضع اسم المجموعه
🔶 ضع معرف > لوضع معرف المجموعه
🔷 تغير الرابط > تغير رابط المجموعه
🔶 الرابط > لضهور الرابط ب المجموعه
🔷 الرابط خاص > الحصول على الرابط خاص
🔷 ضع رابط > لحفظ رابط المجموعه
🔹➖🔹اوامر الامان🔹➖🔹
✖️قفل الميديا بتحذير  > لكتم الصوتيات والصور والفيديو مع التحذير 
✔️ فتح الميديا بتحذير > للسماح بالصوتيات والصور والفيديو مع التحذير 
✖️قفل الاضافه >لمنع الاضافه 
✔️ فتح الاضافه > لمنع اضافه الاعضاء  
✖️قفل الدردشه > منع الدردشه في المجموعه
✔️ فتح الدردشه > للسماح للدردشه في المجموعه
✖️ قفل الصور > لمنع إرسال الصور 
✔️ فتح الصور > للسماح بإرسال الصور 
✖️ قفل الصوت > لمنع البصمات 
✔️ فتح الصوت > للسماح بإرسال البصمات 
✖️ قفل الفيديو > لمنع ارسال فديو 
✔️ فتح الفيديو > للسماح بإرسال فديو 
✖️ قفل الروابط > لمنع الروابط 
✔️ فتح الروابط > للسماح بإرسال روابط
✖️ قفل التكرار > لمنع التكرار 
✔️ فتح التكرار > للسماح بلتكرار 
✖️ قفل الملصقات > لمنع الملصقات 
✔️ فتح الملصقات > للسماح بلملصقات
✖️ قفل الصور المتحركه > لمنع الصور المتحركة
✔️ فتح الصور المتحركه > للسماح بالصور المتحركة
✖️ قفل الفايلات > لمنع ارسال الملفات 
✔️ فتح الفايلات > للسماح بإرسال الملفات 
✖️ قفل الكلايش > لمنع الكلايش الطويلة
✔️ فتح الكلايش > للسماح بلكلايش الطويلة
✖️ قفل الاضافه الجماعيه > لمنع الاعضاء من الاضافه
✔️ فتح الاضافه الجماعيه > لسماح للاعضاء بالاضافه
✖️ قفل العربيه > لمنع اللغة ألعربيه 
✔️ فتح العربيه > للسماح بلغه ألعربيه
✖️قفل اعاده توجيه > منع التوجيه لمجموعه
✔️فتح اعاده توجيه > السماح بالتوجيه في المجم
♻️/مسح  lمسح الرساله بالرد
♻ rm + عدد الرسائل المراد حذفها 
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
مطور البوت <3
🍁 @mohmed 🍁
🍁@mlove994_bot🍁



]]
reply_msg(reply_id, alnaze, ok_cb, false)
end

local reply_id = msg['id']
if not is_momod(msg) then
local alnaz = "للمشرفين فقط ????:sunglasses:"
reply_msg(reply_id, alnaze, ok_cb, false)
end

end
return {
patterns ={
"^(اوامر)$",
},
run = run
}
end
